In [40]:
import numpy as np
import pandas as pd

In [ ]:
dict1 = {
    "name":['priyanshu','rohan','sohan','skillf','yyyy'],
    "marks":[92, 34, 44,54,55],
    "city":['lucknow','delhi','kanpur','bareilly','goa']
}

In [42]:
df = pd.DataFrame(dict1)

ValueError: All arrays must be of the same length

In [ ]:
df

        name  marks      city
0  priyanshu     92   lucknow
1      rohan     34     delhi
2      sohan     44    kanpur
3     skillf     54  bareilly
4                55       goa

In [ ]:
df.to_csv('friends.csv')

In [ ]:
df.to_csv('friends_indexfalse.csv', index = False)

In [ ]:
df.head(2)

        name  marks     city
0  priyanshu     92  lucknow
1      rohan     34    delhi

In [ ]:
df.tail(3)

     name  marks      city
2   sohan     44    kanpur
3  skillf     54  bareilly
4             55       goa

In [ ]:
df.describe()

           marks
count   5.000000
mean   55.800000
std    21.959053
min    34.000000
25%    44.000000
50%    54.000000
75%    55.000000
max    92.000000

In [ ]:
df.describe(include='all')

             name      marks     city
count           5   5.000000        5
unique          5        NaN        5
top     priyanshu        NaN  lucknow
freq            1        NaN        1
mean          NaN  55.800000      NaN
std           NaN  21.959053      NaN
min           NaN  34.000000      NaN
25%           NaN  44.000000      NaN
50%           NaN  54.000000      NaN
75%           NaN  55.000000      NaN
max           NaN  92.000000      NaN

In [ ]:
priyanshu = pd.read('priyanshu.csv')

AttributeError: module 'pandas' has no attribute 'read'

In [ ]:
priyanshu = pd.read_csv('priyanshu.csv')

In [ ]:
priyanshu

   train_no  speed     city
0     12344    123  lucknow
1     23444    344    delhi
2     23322    133     gola
3      2345    435  chennai

In [ ]:
priyanshu.head(3)

   train_no  speed     city
0     12344    123  lucknow
1     23444    344    delhi
2     23322    133     gola

In [ ]:
priyanshu.tail(2)

   train_no  speed     city
2     23322    133     gola
3      2345    435  chennai

In [ ]:
priyanshu.describe()

           train_no       speed
count      4.000000    4.000000
mean   15363.750000  258.750000
std    10119.797836  155.534294
min     2345.000000  123.000000
25%     9844.250000  130.500000
50%    17833.000000  238.500000
75%    23352.500000  366.750000
max    23444.000000  435.000000

In [ ]:
priyanshu.describe(include='all')

            train_no       speed     city
count       4.000000    4.000000        4
unique           NaN         NaN        4
top              NaN         NaN  lucknow
freq             NaN         NaN        1
mean    15363.750000  258.750000      NaN
std     10119.797836  155.534294      NaN
min      2345.000000  123.000000      NaN
25%      9844.250000  130.500000      NaN
50%     17833.000000  238.500000      NaN
75%     23352.500000  366.750000      NaN
max     23444.000000  435.000000      NaN

In [ ]:
priyanshu['speed'][0]= 125

C:\Users\verma\AppData\Local\Temp\ipykernel_12196\2568459189.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  priyanshu['speed'][0]= 125

In [ ]:
priyanshu

   train_no  speed     city
0     12344    125  lucknow
1     23444    344    delhi
2     23322    133     gola
3      2345    435  chennai

In [ ]:
priyanshu.to_csv("priyanshu.csv",index = False)

In [ ]:
priyanshu['city'][2] = "Gola Gokarnnath"

C:\Users\verma\AppData\Local\Temp\ipykernel_12196\1859741309.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  priyanshu['city'][2] = "Gola Gokarnnath"

In [ ]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai

In [ ]:
priyanshu.to_csv("priyanshu.csv",index = False)

In [ ]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai

In [ ]:
priyanshu.index = ['first', 'second','third','fourth']

In [ ]:
priyanshu

        train_no  speed             city
first      12344    125          lucknow
second     23444    344            delhi
third      23322    133  Gola Gokarnnath
fourth      2345    435          chennai

In [ ]:
ser = pd.Series(np.random.rand(22))

In [ ]:
type(ser)

pandas.core.series.Series

In [ ]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [ ]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.436473  0.300883  0.523059  0.603896  0.674207
1  0.937017  0.047547  0.372668  0.871092  0.455917
2  0.117023  0.122808  0.845237  0.447774  0.975374
3  0.260659  0.987704  0.143535  0.853833  0.478781
4  0.899011  0.605387  0.006815  0.412112  0.343412

In [ ]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
newdf[0][0] = "priyanshu"

C:\Users\verma\AppData\Local\Temp\ipykernel_12196\475059861.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "priyanshu"
C:\Users\verma\AppData\Local\Temp\ipykernel_12196\475059861.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0] = "priyanshu"
C:\Users\verma\AppData\Local\Temp\ipykernel_12196\475059861.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'priyanshu' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "priyanshu"

In [ ]:
newdf.dtypes

0     object
1    float64
2    float64
3     object
4    float64
dtype: object

In [ ]:
newdf.head()

           0         1         2          3         4
0  priyanshu  0.300883  0.523059   0.603896  0.674207
1   0.937017  0.047547  0.372668   0.871092  0.455917
2   0.117023  0.122808  0.845237  priyanshu  0.975374
3   0.260659  0.987704  0.143535   0.853833  0.478781
4   0.899011  0.605387  0.006815   0.412112  0.343412

In [ ]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [ ]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [ ]:
newdf.to_numpy()

array([['priyanshu', 0.3008828874596565, 0.5230593199921333,
        0.6038955508048935, 0.6742069299354221],
       [0.9370172865619629, 0.04754730424695852, 0.3726684482285245,
        0.8710921515190235, 0.4559169028518051],
       [0.11702302005234011, 0.12280847435136577, 0.8452369295034979,
        'priyanshu', 0.9753740479281268],
       ...,
       [0.44803879028604077, 0.07493125271987411, 0.3553032673398704,
        0.9270610931379482, 0.8404488945249611],
       [0.5591339301952333, 0.7334955121019168, 0.43654111718513444,
        0.26223320272450523, 0.1951184790398175],
       [0.671670709229143, 0.7420423345411938, 0.8979029639075845,
        0.02333269684629191, 0.9012682162815581]], dtype=object)

In [ ]:
newdf[0][0] = 0.34356

In [ ]:
newdf[3][2] = 0.2244

In [ ]:
newdf.dtypes

0     object
1    float64
2    float64
3     object
4    float64
dtype: object

In [ ]:
newdf

            0         1         2         3         4
0     0.34356  0.300883  0.523059  0.603896  0.674207
1    0.937017  0.047547  0.372668  0.871092  0.455917
2    0.117023  0.122808  0.845237    0.2244  0.975374
3    0.260659  0.987704  0.143535  0.853833  0.478781
4    0.899011  0.605387  0.006815  0.412112  0.343412
..        ...       ...       ...       ...       ...
329  0.093395  0.926232  0.100058  0.662029  0.435659
330  0.323173  0.071553  0.968605  0.349616  0.566707
331  0.448039  0.074931  0.355303  0.927061  0.840449
332  0.559134  0.733496  0.436541  0.262233  0.195118
333  0.671671  0.742042  0.897903  0.023333  0.901268

[334 rows x 5 columns]

In [ ]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.34356,0.937017,0.117023,0.260659,0.899011,0.179648,0.891461,0.567387,0.250161,0.143346,...,0.26651,0.544456,0.470714,0.527166,0.6023,0.093395,0.323173,0.448039,0.559134,0.671671
1,0.300883,0.047547,0.122808,0.987704,0.605387,0.792947,0.754685,0.189792,0.478123,0.293253,...,0.857546,0.686408,0.2759,0.2995,0.578444,0.926232,0.071553,0.074931,0.733496,0.742042
2,0.523059,0.372668,0.845237,0.143535,0.006815,0.848475,0.933543,0.848825,0.484358,0.402445,...,0.215849,0.900434,0.246753,0.956301,0.753617,0.100058,0.968605,0.355303,0.436541,0.897903
3,0.603896,0.871092,0.2244,0.853833,0.412112,0.92356,0.446573,0.759564,0.634873,0.48574,...,0.156541,0.95264,0.452693,0.681669,0.977795,0.662029,0.349616,0.927061,0.262233,0.023333
4,0.674207,0.455917,0.975374,0.478781,0.343412,0.526609,0.158667,0.822146,0.599476,0.917392,...,0.50065,0.258929,0.715321,0.401742,0.711312,0.435659,0.566707,0.840449,0.195118,0.901268